xAxis = ['2010', '2011', '2012', '2013', '2014', '2015', '2016']
legend = ['四川', '湖南', '广东', '江苏', '浙江'],
series_list = [
    {
        "data": [140, 232, 101, 264, 90, 340, 250]
    },
    {
        "data": [120, 282, 111, 234, 220, 340, 310],
    },
    {
        "data": [320, 132, 201, 334, 190, 130, 220],
    },
    {
        "data": [220, 402, 231, 134, 190, 230, 120],
    },
]
result = {
    'status': True,
    'data': {
        'legend': legend,
        'series': series_list,
        'x_axis': xAxis,
    }
}
print(series_list[0])
